# Data Frame

In [1]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,915.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
# Printing the data frame.            
print(emp.data)

  employee_id employee_name    sal starting_date
1           1       Shubham 623.30    2012-01-01
2           2        Arpita 915.20    2013-09-23
3           3        Nishka 611.00    2014-11-15
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27

In [2]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
# Printing the structure of data frame.           
str(emp.data)

'data.frame':	5 obs. of  4 variables:
 $ employee_id  : int  1 2 3 4 5
 $ employee_name: chr  "Shubham" "Arpita" "Nishka" "Gunjan" ...
 $ sal          : num  623 515 611 729 843
 $ starting_date: Date, format: "2012-01-01" "2013-09-23" ...

In [4]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name= c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
# Extracting specific columns from a data frame       
final <- data.frame(emp.data$employee_id,emp.data$sal)  
print(final)

  emp.data.employee_id emp.data.sal
1                    1       623.30
2                    2       515.20
3                    3       611.00
4                    4       729.00
5                    5       843.25

In [5]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
# Extracting first row from a data frame      
final <- emp.data[1,]  
print(final)  
  
  
# Extracting last two row from a data frame       
final <- emp.data[4:5,]  
print(final)

  employee_id employee_name   sal starting_date
1           1       Shubham 623.3    2012-01-01
  employee_id employee_name    sal starting_date
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27

In [6]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
print(emp.data)  
  
#Adding row in the data frame  
x <- list(6,"Vaishali",547,"2015-09-01")  
rbind(emp.data,x)  
  
#Adding column in the data frame  
y <- c("Moradabad","Lucknow","Etah","Sambhal","Khurja")  
cbind(emp.data,Address=y)

  employee_id employee_name    sal starting_date
1           1       Shubham 623.30    2012-01-01
2           2        Arpita 515.20    2013-09-23
3           3        Nishka 611.00    2014-11-15
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27

  employee_id employee_name sal    starting_date
1 1           Shubham       623.30 2012-01-01
2 2           Arpita        515.20 2013-09-23
3 3           Nishka        611.00 2014-11-15
4 4           Gunjan        729.00 2014-05-11
5 5           Sumit         843.25 2015-03-27
6 6           Vaishali      547.00 2015-09-01

  employee_id employee_name sal    starting_date Address
1 1           Shubham       623.30 2012-01-01    Moradabad
2 2           Arpita        515.20 2013-09-23    Lucknow
3 3           Nishka        611.00 2014-11-15    Etah
4 4           Gunjan        729.00 2014-05-11    Sambhal
5 5           Sumit         843.25 2015-03-27    Khurja

In [8]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
print(emp.data)  
  
#Delete rows from data frame  
emp.data<-emp.data[-2,]  
print(emp.data)  
  
#Delete column from the data frame  
emp.data$starting_date<-NULL  
print(emp.data)

  employee_id employee_name    sal starting_date
1           1       Shubham 623.30    2012-01-01
2           2        Arpita 515.20    2013-09-23
3           3        Nishka 611.00    2014-11-15
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27
  employee_id employee_name    sal starting_date
1           1       Shubham 623.30    2012-01-01
3           3        Nishka 611.00    2014-11-15
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27
  employee_id employee_name    sal
1           1       Shubham 623.30
3           3        Nishka 611.00
4           4        Gunjan 729.00
5           5         Sumit 843.25

In [9]:
# Creating the data frame.  
emp.data<- data.frame(  
employee_id = c (1:5),   
employee_name = c("Shubham","Arpita","Nishka","Gunjan","Sumit"),  
sal = c(623.3,515.2,611.0,729.0,843.25),   
  
starting_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11",  
      "2015-03-27")),  
stringsAsFactors = FALSE  
)  
print(emp.data)  
  
#Printing the summary  
print(summary(emp.data))

  employee_id employee_name    sal starting_date
1           1       Shubham 623.30    2012-01-01
2           2        Arpita 515.20    2013-09-23
3           3        Nishka 611.00    2014-11-15
4           4        Gunjan 729.00    2014-05-11
5           5         Sumit 843.25    2015-03-27
  employee_id employee_name           sal        starting_date
 Min.   :1    Length:5           Min.   :515.2   Min.   :2012-01-01
 1st Qu.:2    Class :character   1st Qu.:611.0   1st Qu.:2013-09-23
 Median :3    Mode  :character   Median :623.3   Median :2014-05-11
 Mean   :3                       Mean   :664.4   Mean   :2014-01-14
 3rd Qu.:4                       3rd Qu.:729.0   3rd Qu.:2014-11-15
 Max.   :5                       Max.   :843.2   Max.   :2015-03-27